SAMS0N1TE/LakeShark/components/esp_lvgl_port/src/lvgl8/esp_lvgl_port_disp.c
/*
 * SPDX-FileCopyrightText: 2024-2025 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <string.h>
#include "esp_log.h"
#include "esp_err.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_idf_version.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lvgl_port.h"
#include "esp_lvgl_port_priv.h"
#include "esp_lvgl_port_disp_stats.h"  /*LS-781*/
#include "esp_attr.h"
#include "esp_timer.h"

/*LS-781  Refresh cadence counters - see esp_lvgl_port_disp_stats.h. The 4.3
   panel's blue frame is a DPI underrun and the driver reports no such event,
   so measure the interval between completed refreshes instead. Internal DRAM:
   this is written from the refresh ISR. */
static DRAM_ATTR uint32_t s_disp_frames;
static DRAM_ATTR uint32_t s_disp_late;
static DRAM_ATTR uint32_t s_disp_max_gap_us;
static DRAM_ATTR uint32_t s_disp_last_gap_us;
static DRAM_ATTR uint32_t s_disp_threshold_us = 37000; /* ~1.5 frames at 40 fps */
static DRAM_ATTR int64_t  s_disp_last_us;
/*LS-802*/
static DRAM_ATTR uint32_t s_disp_late_pending;
/*LS-803*/
static DRAM_ATTR TaskHandle_t s_disp_late_task;
static portMUX_TYPE s_disp_stats_lock = portMUX_INITIALIZER_UNLOCKED;

static inline IRAM_ATTR void lvgl_port_disp_stats_tick(void)
{
    int64_t now = esp_timer_get_time();
    int64_t prev = s_disp_last_us;
    s_disp_last_us = now;
    s_disp_frames++;
    if (prev == 0) return;                     /* no interval yet */
    int64_t gap = now - prev;
    if (gap < 0 || gap > 0xFFFFFFFF) return;   /* clock went backwards/wrapped */
    uint32_t gap_us = (uint32_t)gap;
    s_disp_last_gap_us = gap_us;
    if (gap_us > s_disp_max_gap_us) s_disp_max_gap_us = gap_us;
    if (gap_us > s_disp_threshold_us) {
        s_disp_late++;
        s_disp_late_pending = gap_us;   /*LS-802  reported by a task */
        /*LS-803  Whoever was on this core when the refresh was missed. */
        s_disp_late_task = xTaskGetCurrentTaskHandle();
    }
}

void lvgl_port_disp_stats_get(lvgl_port_disp_stats_t *out)
{
    if (!out) return;
    portENTER_CRITICAL(&s_disp_stats_lock);
    out->frames       = s_disp_frames;
    out->late         = s_disp_late;
    out->max_gap_us   = s_disp_max_gap_us;
    out->last_gap_us  = s_disp_last_gap_us;
    out->threshold_us = s_disp_threshold_us;
    portEXIT_CRITICAL(&s_disp_stats_lock);
    out->uptime_ms = (uint32_t)(esp_timer_get_time() / 1000);
}

/*LS-803*/
const char *lvgl_port_disp_stats_late_task(void)
{
    TaskHandle_t t = s_disp_late_task;
    return t ? pcTaskGetName(t) : NULL;
}

/*LS-802*/
uint32_t lvgl_port_disp_stats_take_late(void)
{
    portENTER_CRITICAL(&s_disp_stats_lock);
    uint32_t gap = s_disp_late_pending;
    s_disp_late_pending = 0;
    portEXIT_CRITICAL(&s_disp_stats_lock);
    return gap;
}

void lvgl_port_disp_stats_reset(uint32_t threshold_us)
{
    portENTER_CRITICAL(&s_disp_stats_lock);
    s_disp_frames = 0;
    s_disp_late = 0;
    s_disp_max_gap_us = 0;
    s_disp_last_gap_us = 0;
    s_disp_last_us = 0;
    s_disp_late_pending = 0;   /*LS-802*/
    if (threshold_us) s_disp_threshold_us = threshold_us;
    portEXIT_CRITICAL(&s_disp_stats_lock);
}

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"

#if CONFIG_IDF_TARGET_ESP32S3 && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
#include "esp_lcd_panel_rgb.h"
#endif

#if (CONFIG_IDF_TARGET_ESP32P4 && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
#include "esp_lcd_mipi_dsi.h"
#endif

#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(4, 4, 4)) || (ESP_IDF_VERSION == ESP_IDF_VERSION_VAL(5, 0, 0))
#define LVGL_PORT_HANDLE_FLUSH_READY 0
#else
#define LVGL_PORT_HANDLE_FLUSH_READY 1
#endif

static const char *TAG = "LVGL";

/*******************************************************************************
* Types definitions
*******************************************************************************/

typedef struct {
    lvgl_port_disp_type_t     disp_type;    /* Display type */
    esp_lcd_panel_io_handle_t io_handle;    /* LCD panel IO handle */
    esp_lcd_panel_handle_t    panel_handle; /* LCD panel handle */
    esp_lcd_panel_handle_t    control_handle; /* LCD panel control handle */
    lvgl_port_rotation_cfg_t  rotation;     /* Default values of the screen rotation */
    lv_disp_drv_t             disp_drv;     /* LVGL display driver */
    lv_color_t                *trans_buf;   /* Buffer send to driver */
    uint32_t                  trans_size;   /* Maximum size for one transport */
    SemaphoreHandle_t         trans_sem;    /* Idle transfer mutex */
} lvgl_port_display_ctx_t;

/*******************************************************************************
* Function definitions
*******************************************************************************/
static lv_disp_t *lvgl_port_add_disp_priv(const lvgl_port_display_cfg_t *disp_cfg, const lvgl_port_disp_priv_cfg_t *priv_cfg);
static lvgl_port_display_ctx_t *lvgl_port_get_display_ctx(lv_disp_t *disp);
#if LVGL_PORT_HANDLE_FLUSH_READY
static bool lvgl_port_flush_io_ready_callback(esp_lcd_panel_io_handle_t panel_io, esp_lcd_panel_io_event_data_t *edata, void *user_ctx);
#if (CONFIG_IDF_TARGET_ESP32S3 && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0))
static bool lvgl_port_flush_rgb_vsync_ready_callback(esp_lcd_panel_handle_t panel_io, const esp_lcd_rgb_panel_event_data_t *edata, void *user_ctx);
#endif
#if (CONFIG_IDF_TARGET_ESP32P4 && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 3, 0))
static bool lvgl_port_flush_dpi_panel_ready_callback(esp_lcd_panel_handle_t panel_io, esp_lcd_dpi_panel_event_data_t *edata, void *user_ctx);
static bool lvgl_port_flush_dpi_vsync_ready_callback(esp_lcd_panel_handle_t panel_io, esp_lcd_dpi_panel_event_data_t *edata, void *user_ctx);
#endif
#endif
static void lvgl_port_flush_callback(lv_disp_drv_t *drv, const lv_area_t *area, lv_color_t *color_map);
static void lvgl_port_update_callback(lv_disp_drv_t *drv);
static void lvgl_port_pix_monochrome_callback(lv_disp_drv_t *drv, uint8_t *buf, lv_coord_t buf_w, lv_coord_t x, lv_coord_t y, lv_color_t color, lv_opa_t opa);

